[
  {
    "name": "John Waters",
    "portrait": "assets/images/john-waters.jpg",
    "biography": " John Waters is known for his distinctive pencil-thin mustache, which has become a hallmark of his personal style.The mustache is groomed to be narrow and straight, extending just beyond the corners of his mouth. It is typically black in color, and stands out against his fair skin. Waters has been known to dye his mustache to maintain its dark color, and he has stated that he considers it to be an important part of his public persona. Overall, John Waters' mustache is a defining feature of his unique look, and has become an iconic symbol of his subversive style and irreverent sense of humor."
  },
  {
    "name": "Little Richard",
    "portrait": "assets/images/little-richard.jpg",
    "biography": "The late Little Richard, also known as \"The Architect of Rock and Roll,\" was known for his flamboyant and energetic performances, as well as his distinctive personal style, which included a pencil mustache. The mustache was thin and closely trimmed, with sharply defined edges that extended just beyond the corners of his mouth. It was typically styled to be straight and narrow, emphasizing its sharp and precise appearance. The pencil mustache was often paired with a close-cropped beard or goatee, which helped to balance out the overall look. Little Richard's pencil mustache was a signature part of his larger-than-life persona, and it helped to establish him as a true rock and roll icon."
  },
  {
    "name": "Vincent Price",
    "portrait": "assets/images/vincent-price.jpg",
    "biography": "Vincent Price was an American actor known for his distinctive voice and his roles in horror films. He was also known for his distinguished and sophisticated style, which included a well-groomed mustache. Price's mustache was thick and full, but not overly bushy. It was typically styled to be straight and neatly trimmed, with sharply defined edges that extended just beyond the corners of his mouth. The mustache was usually a shade darker than his hair, which was often silver or gray in his later years. Price's mustache was a defining feature of his elegant and refined appearance, and it added to his overall aura of sophistication and intellect. It remains an iconic part of his legacy and personal style."
  },
  {
    "name": "Sammy Davis Jr.",
    "portrait": "assets/images/sammy-davis-jr.jpg",
    "biography": "Sammy Davis Jr. was a legendary performer and member of the Rat Pack, known for his smooth vocals and flashy style. His mustache was an important part of his look, and it was typically styled to be thin and neatly trimmed. The mustache was closely groomed and typically black in color, matching his hair, which he often wore in a short, slicked-back style. The edges of the mustache were sharply defined and extended just beyond the corners of his mouth, emphasizing the shape of his face and his distinctive smile. Overall, Sammy Davis Jr.'s mustache was an integral part of his sleek and stylish appearance, and it helped to add to his overall sense of charisma and cool."
  }

]